#+STARTUP: overview
#+latex_class_options: [14pt]

*** Integer factorization in Rust
#+BEGIN_SRC rustic
fn factorize(n: i32) -> Vec<i32> {
    let sqrt_n = (n as f32).sqrt() as i32;

    let mut factors = vec![];
    // we only need to test up to sqrt(n)
    for factor in 2..=sqrt_n {
        // found an integer factor
        if n % factor == 0 {
            // since a = fac1 * fac2 we can record two factors
            factors.push(factor);
            factors.push(n / factor);
        }
    }
   factors
}

let n = 16;
println!("factors of {n}: {:?}", factorize(n))
#+END_SRC

#+RESULTS:
: factors of 16: [2, 8, 4, 4]

* DONE Euclidean Algorithm
:PROPERTIES:
:ID:       43e6617a-26c8-4c42-be27-4836ebc46a30
:END:
What is the GCD of 39 and 27?

|  A |   B | Remainder                             |
|----+-----+---------------------------------------|
| 39 |  27 | 12 = 39 - floor(39/27) * 27 (39 % 27) |
| 27 |  12 | 3 = 27 - floor(27/12) * 12 (27 % 12)  |
| 12 | *3* | 0 = 12 - floor(12/3) * 12  (12 % 3)   |

---

*NOTES*

- algorithm will work even if we switch A and B
  - 27 % 37 = 27 so we just have one more step to do in this case
- In every step we move everythign the left (throwing away A)
- stop condition is the Remainder being 0
  - result is then stored in B
- algorithm runs in $\mathcal{O}(log(A+B))$

---

#+BEGIN_SRC rustic
pub fn gcd(a: i32, b: i32) -> i32 {
    if b == 0 {
        return a;
    }
    gcd(b, a % b)
}

println!("{}", gcd(39, 27));
#+END_SRC

#+RESULTS:
: 3

** DONE Example: clock (example 8 MoonMath)

#+BEGIN_SRC sage :session . :exports both

# starting at 5 and adding 12 we are at 5 again (as on the clock face)
(5 + 12) % 12

# when we subtract 12 hours, we are at 5 o’clock again, representing the number −7
(5 - 12) % 12

# all these integers are congruent modulo 12 (euclidean division remainder is the same)
[n % 12 for n in [-7,5,17,29] ]
#+END_SRC

#+RESULTS:
: [5, 5, 5, 5]
: 5
: 5
*** DONE Example: CRT
$x \equiv 2 \pmod{3}$
$x \equiv 3 \pmod{5}$
$x \equiv 2 \pmod{7}$

1. Compute the product $M=m_1m_2,\ldots,m_k$

$M=3\cdot5\cdot7=105$

2. Compute partial products $\forall i=1,\ldots,k \hspace{.5em} M_i=\frac{M}{m_i}$

$M_1=(3\cdot5\cdot7)/3=35$
$M_2=(3\cdot5\cdot7)/5=21$
$M_3=(3\cdot5\cdot7)/7=15$

1. Find modular inverses $y_i$: $\forall i \hspace{.5em} M_i y_i \equiv 1 \pmod{m_i}$. We know these inverses exist because $gcd(M_i,m_i)=1$

$35 y_1 =1 \pmod{3} \leftrightarrow y_1=2$
$21 y_2 =1 \pmod{5} \leftrightarrow y_2=1$
$15 y_3 =1 \pmod{7} \leftrightarrow y_3=1$

4. Combine the Results. The solution $x$ can be constructed as: $x=\sum_{i=1}^{k}a_iM_iy_i \pmod{M}$ (ensures that $x$ satisfies all the congruences):

$x = (2 \cdot 35 \cdot 2) + (3 \cdot 32 \cdot 1) + (2 \cdot 15 \cdot 1) \pmod{105}$
$x = 233 \pmod{105} = 23$

The solution set consists of all the integers that have the remainder 23 under euclidean divison mod 105 (are congruent mod 105).

#+BEGIN_SRC sage :session . :exports both
x=CRT_list([2,3,2], [3,5,7])
x

# example range
[x + (i * (3*5*7)) for i in range(-2, 3) ]
#+END_SRC

#+RESULTS:
: 23
: [-187, -82, 23, 128, 233]

*** DONE Example 11 MoonMath (Arithmetic modulo $6$)

Choosing $n=6$ we have six remainder classes of integers that are congruent mod 6 (they have the same remainder when divided mod 6). Let's list them:

#+BEGIN_SRC sage :session . :exports both
m = 6
# init map to store classes
remainder_classes = {r: [] for r in range(m)}

# example range, it's infinite in reality
for x in range(-6, 18):
    remainder_classes[x % m].append(x)

remainder_classes
#+END_SRC

#+RESULTS:
: {0: [-6, 0, 6, 12],
:  1: [-5, 1, 7, 13],
:  2: [-4, 2, 8, 14],
:  3: [-3, 3, 9, 15],
:  4: [-2, 4, 10, 16],
:  5: [-1, 5, 11, 17]}

Remainder classes simplify modular arithmetic, for example to compute $2+5 \hspace{.5em} \text{mod 6}$:

1) Choose arbitrary element from each class e.g $14$ (for $2$) and $-1$ (for $5$).
2) Add those numbers (in the usual way): $14 + (-1) = 13$.
3) $13$ is in the remainder class $r_1$, hence $2+5 \hspace{.5em} \text{mod 6} = 1$:

#+BEGIN_SRC sage :session . :exports both
# ring Z/6Z
Z6=Integers(6)
Z6
Z6(2)+Z6(5)
#+END_SRC

#+RESULTS:
: Ring of integers modulo 6
: 1

Applying the same reasoning to all the remainder classes, addition and multiplication can be transferred to the representatives of the remainder classes:

#+BEGIN_SRC sage :session . :exports both
# ring Z/6Z
Z6 = Integers(6)
add_table = [[Z6(i) + Z6(j) for j in range(6)] for i in range(6)]
mul_table = [[Z6(i) * Z6(j) for j in range(6)] for i in range(6)]

# Print the tables
print("Addition Table in Z6:")
print("+ | " + " ".join(f"{i:2}" for i in range(6)))
print("-" * 20)
for i in range(6):
    print(f"{i} | " + " ".join(f" {add_table[i][j]}" for j in range(6)))

print("\nMultiplication Table in Z6:")
print(". | " + " ".join(f"{i:2}" for i in range(6)))
print("-" * 20)
for i in range(6):
    print(f"{i} | " + " ".join(f" {mul_table[i][j]}" for j in range(6)))
#+END_SRC

#+RESULTS:
#+begin_example
Addition Table in Z6:
+ |  0  1  2  3  4  5
--------------------
0 |  0  1  2  3  4  5
1 |  1  2  3  4  5  0
2 |  2  3  4  5  0  1
3 |  3  4  5  0  1  2
4 |  4  5  0  1  2  3
5 |  5  0  1  2  3  4

Multiplication Table in Z6:
. |  0  1  2  3  4  5
--------------------
0 |  0  0  0  0  0  0
1 |  0  1  2  3  4  5
2 |  0  2  4  0  2  4
3 |  0  3  0  3  0  3
4 |  0  4  2  0  4  2
5 |  0  5  4  3  2  1
#+end_example
